In [107]:
# Initial imports
import pandas as pd
import numpy as np
import datetime as dt
from pathlib import Path

%matplotlib inline

# Data Cleaning

In [108]:
# Use the Pathlib libary to set the path to the CSV
csv_pathwh = Path('whale_returns.csv')
csv_pathal = Path('algo_returns.csv')
csv_pathsp = Path('sp500_history.csv')

# Whale Returns

In [109]:
# Reading whale returns
whale_df = pd.read_csv(csv_pathwh, index_col="Date", infer_datetime_format=True, parse_dates=True)
whale_df.sort_index(inplace=True)
whale_df.head(100)

,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
Date,,,,
2015-03-02,NaN,NaN,NaN,NaN
2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569
2015-03-04,0.002230,0.003241,-0.002534,0.004213
2015-03-05,0.004016,0.004076,0.002355,0.006726
2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098
...,...,...,...,...
2015-07-15,-0.008264,-0.004296,-0.002344,-0.010163
2015-07-16,0.002683,-0.002170,0.003935,0.014835
2015-07-17,-0.001662,-0.003665,0.001108,0.008452
2015-07-20,-0.008217,-0.003349,0.001345,-0.004670
2015-07-21,0.000868,0.000731,-0.006046,-0.001678

In [110]:
whale_df.columns

Index(['SOROS FUND MANAGEMENT LLC', 'PAULSON & CO.INC. ',
       'TIGER GLOBAL MANAGEMENT LLC', 'BERKSHIRE HATHAWAY INC'],
      dtype='object')

In [111]:
whale_df.count()

SOROS FUND MANAGEMENT LLC      1059
PAULSON & CO.INC.              1059
TIGER GLOBAL MANAGEMENT LLC    1059
BERKSHIRE HATHAWAY INC         1059
dtype: int64

In [112]:
# Set the `columns` attribute to a new list of column names
columns = ["SOROS FUND MGT LLC", "PAULSON & CO.INC", "TIGER GLOBAL MGT LLC", "BERKSHIRE HATHAWAY INC"]
whale_df.columns = columns
whale_df.head()

,SOROS FUND MGT LLC,PAULSON & CO.INC,TIGER GLOBAL MGT LLC,BERKSHIRE HATHAWAY INC
Date,,,,
2015-03-02,NaN,NaN,NaN,NaN
2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569
2015-03-04,0.002230,0.003241,-0.002534,0.004213
2015-03-05,0.004016,0.004076,0.002355,0.006726
2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098

In [113]:
# Use the `isnull` function in conjunction with the `sum` function to count the number of null values for each column
whale_df.isnull().sum()

SOROS FUND MGT LLC        1
PAULSON & CO.INC          1
TIGER GLOBAL MGT LLC      1
BERKSHIRE HATHAWAY INC    1
dtype: int64

In [114]:
# Determining percentage of nulls
round((whale_df.isnull().sum() / len(whale_df) * 100),2)

SOROS FUND MGT LLC        0.09
PAULSON & CO.INC          0.09
TIGER GLOBAL MGT LLC      0.09
BERKSHIRE HATHAWAY INC    0.09
dtype: float64

In [115]:
# Use the `duplicated` function to determine the existance of duplicate rows: True or False
whale_df.duplicated()

Date
2015-03-02    False
2015-03-03    False
2015-03-04    False
2015-03-05    False
2015-03-06    False
              ...
2019-04-25    False
2019-04-26    False
2019-04-29    False
2019-04-30    False
2019-05-01    False
Length: 1060, dtype: bool

In [116]:
whale_df.dropna(inplace=True)
whale_df

,SOROS FUND MGT LLC,PAULSON & CO.INC,TIGER GLOBAL MGT LLC,BERKSHIRE HATHAWAY INC
Date,,,,
2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569
2015-03-04,0.002230,0.003241,-0.002534,0.004213
2015-03-05,0.004016,0.004076,0.002355,0.006726
2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098
2015-03-09,0.000582,0.004225,0.005843,-0.001652
...,...,...,...,...
2019-04-25,-0.000285,-0.001291,-0.005153,0.004848
2019-04-26,0.008149,0.009162,0.012355,0.010434
2019-04-29,0.001254,0.002719,0.006251,0.005223
2019-04-30,-0.001295,-0.002211,-0.000259,-0.003702
2019-05-01,-0.005847,-0.001341,-0.007936,-0.007833

In [117]:
# Cleanse nulls from DataFrame by filling na
whale_df= whale_df.fillna("0")
#whale_df['First_Name'] = whale_df['First_Name'].fillna("Unnamed")
#people_df['Last_Name'] = people_df['Last_Name'].fillna("Unnamed")
whale_df

,SOROS FUND MGT LLC,PAULSON & CO.INC,TIGER GLOBAL MGT LLC,BERKSHIRE HATHAWAY INC
Date,,,,
2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569
2015-03-04,0.002230,0.003241,-0.002534,0.004213
2015-03-05,0.004016,0.004076,0.002355,0.006726
2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098
2015-03-09,0.000582,0.004225,0.005843,-0.001652
...,...,...,...,...
2019-04-25,-0.000285,-0.001291,-0.005153,0.004848
2019-04-26,0.008149,0.009162,0.012355,0.010434
2019-04-29,0.001254,0.002719,0.006251,0.005223
2019-04-30,-0.001295,-0.002211,-0.000259,-0.003702
2019-05-01,-0.005847,-0.001341,-0.007936,-0.007833

# Algorithmic Daily Returns

In [118]:
# Reading Algorithmix returns
algo_df = pd.read_csv(csv_pathal, index_col="Date", infer_datetime_format=True, parse_dates=True)
algo_df.sort_index(inplace=True)
algo_df.head(100)

              Algo 1    Algo 2
Date
2014-05-28  0.001745       NaN
2014-05-29  0.003978       NaN
2014-05-30  0.004464       NaN
2014-06-02  0.005692       NaN
2014-06-03  0.005292       NaN
...              ...       ...
2014-10-10 -0.012612 -0.011752
2014-10-13 -0.018528 -0.002009
2014-10-14  0.000702  0.004501
2014-10-15  0.021616 -0.000977
2014-10-16  0.098246  0.083734

[100 rows x 2 columns]

In [119]:
algo_df.columns

Index(['Algo 1', 'Algo 2'], dtype='object')

In [120]:
algo_df.count()

Algo 1    1241
Algo 2    1235
dtype: int64

In [121]:
# Use the `isnull` function in conjunction with the `sum` function to count the number of null values for each column
algo_df.isnull().sum()

Algo 1    0
Algo 2    6
dtype: int64

In [122]:
# Determining percentage of nulls
round((algo_df.isnull().sum() / len(algo_df) * 100),2)

Algo 1    0.00
Algo 2    0.48
dtype: float64

In [123]:
algo_df.dropna(inplace=True)
algo_df

              Algo 1    Algo 2
Date
2014-06-05  0.004062  0.013285
2014-06-06  0.001857  0.008284
2014-06-09 -0.005012  0.005668
2014-06-10  0.004406 -0.000735
2014-06-11  0.004760 -0.003761
...              ...       ...
2019-04-25  0.000682 -0.007247
2019-04-26  0.002981  0.005256
2019-04-29  0.005208  0.002829
2019-04-30 -0.002944 -0.001570
2019-05-01  0.000094 -0.007358

[1235 rows x 2 columns]

In [124]:
# Use the `isnull` function in conjunction with the `sum` function to count the number of null values for each column
algo_df.isnull().sum()

Algo 1    0
Algo 2    0
dtype: int64

In [125]:
#earliest_date = algo_df["Date"].min()
#latest_date = algo_df["Date"].max()

# print the earliest and latest dates
#print(earliest_date)
#print(latest_date) --- Discuss with your TA why you are getting error

In [126]:
# If you want to select records within a data range,After setting the `Date` as the index, loc can be used to specify a range of dates
six_month_filtered_df = algo_df.loc['2017-01-03':'2017-06-03', :]
six_month_filtered_df

              Algo 1    Algo 2
Date
2017-01-03  0.007381  0.009358
2017-01-04  0.012510  0.014701
2017-01-05 -0.003955 -0.001872
2017-01-06 -0.000364  0.000051
2017-01-09  0.002775 -0.006277
...              ...       ...
2017-05-26  0.000340  0.001880
2017-05-30 -0.012335 -0.005713
2017-05-31 -0.001981 -0.001719
2017-06-01  0.010236  0.010217
2017-06-02 -0.001769  0.006703

[105 rows x 2 columns]

# S&P 500 Returns

In [127]:
# Reading S&P 500 Closing Prices
sp_df = pd.read_csv(csv_pathsp, index_col="Date", infer_datetime_format=True, parse_dates=True)
sp_df.sort_index(inplace=True)
sp_df.head(100)

               Close
Date
2012-10-01  $1444.49
2012-10-02  $1445.75
2012-10-03  $1450.99
2012-10-04  $1461.40
2012-10-05  $1460.93
...              ...
2013-02-20  $1511.95
2013-02-21  $1502.42
2013-02-22  $1515.60
2013-02-25  $1487.85
2013-02-26  $1496.94

[100 rows x 1 columns]

In [128]:
# Determining percentage of nulls
round((sp_df.isnull().sum() / len(sp_df) * 100),2)

Close    0.0
dtype: float64

In [129]:
sp_df.dtypes

Close    object
dtype: object

In [130]:
# Clean identified numeric fields with $ symbol
sp_df["Close"] = sp_df["Close"].str.replace("$", "")
sp_df["Close"]
sp_df.head(100)

              Close
Date
2012-10-01  1444.49
2012-10-02  1445.75
2012-10-03  1450.99
2012-10-04  1461.40
2012-10-05  1460.93
...             ...
2013-02-20  1511.95
2013-02-21  1502.42
2013-02-22  1515.60
2013-02-25  1487.85
2013-02-26  1496.94

[100 rows x 1 columns]

# Check data type

In [131]:
algo_df.dtypes

Algo 1    float64
Algo 2    float64
dtype: object

In [132]:
whale_df.dtypes

SOROS FUND MGT LLC        float64
PAULSON & CO.INC          float64
TIGER GLOBAL MGT LLC      float64
BERKSHIRE HATHAWAY INC    float64
dtype: object

In [133]:
sp_df.dtypes

Close    object
dtype: object

In [134]:
# Fix Data Types
# Use the `as_type` function to convert `Person_ID` from `float` to `int`
#people_df['Person_ID'] = people_df['Person_ID'].astype('int')
#people_df
sp_df = sp_df.astype("float")
sp_df

              Close
Date
2012-10-01  1444.49
2012-10-02  1445.75
2012-10-03  1450.99
2012-10-04  1461.40
2012-10-05  1460.93
...             ...
2019-04-16  2907.06
2019-04-17  2900.45
2019-04-18  2905.03
2019-04-22  2907.97
2019-04-23  2933.68

[1649 rows x 1 columns]

In [149]:
# Check Data type again
sp_df.dtypes

Close    float64
dtype: object

In [150]:
 # Calculate Daily Returns
sp_daily_returns = sp_df.pct_change().dropna()
sp_daily_returns.head(100)

               Close
Date
2012-10-02  0.000872
2012-10-03  0.003624
2012-10-04  0.007174
2012-10-05 -0.000322
2012-10-08 -0.003457
...              ...
2013-02-21 -0.006303
2013-02-22  0.008773
2013-02-25 -0.018310
2013-02-26  0.006109
2013-02-27  0.012726

[100 rows x 1 columns]

In [151]:
sp_df.count()

Close    1649
dtype: int64

In [152]:
# Use the `isnull` function in conjunction with the `sum` function to count the number of null values for each column
sp_df.isnull().sum()

Close    0
dtype: int64

In [153]:
sp_df.dropna(inplace=True)
sp_df

              Close
Date
2012-10-01  1444.49
2012-10-02  1445.75
2012-10-03  1450.99
2012-10-04  1461.40
2012-10-05  1460.93
...             ...
2019-04-16  2907.06
2019-04-17  2900.45
2019-04-18  2905.03
2019-04-22  2907.97
2019-04-23  2933.68

[1649 rows x 1 columns]

In [154]:
# Set the `columns` attribute to a new list of column names
columns = ["DAILY_RETURNS"]
sp_daily_returns.columns = columns
sp_daily_returns.head()

            DAILY_RETURNS
Date
2012-10-02       0.000872
2012-10-03       0.003624
2012-10-04       0.007174
2012-10-05      -0.000322
2012-10-08      -0.003457